# Panda library

In [1]:
import pandas as pd
d={"name":["a","b","c","d"],'roll':[1,2,3,4]}
print(d)
df=pd.DataFrame(d)
print(df)

{'name': ['a', 'b', 'c', 'd'], 'roll': [1, 2, 3, 4]}
  name  roll
0    a     1
1    b     2
2    c     3
3    d     4

In [2]:
import pandas as pd
d={"rol":[1,2,3,4,5],"name":["a","b","c","d","e"],"marks":[11,12,13,14,15]}
df=pd.DataFrame(d)
print(df)

print(df.info())
print(df.head())  #first 5
print(df.head(2))
print(df.tail())   #last five
print(df.tail(2))
print(df.mean())
print(df.sum())
print(df.min())
print(df.max())
print(df.count())
print(df.describe())

   rol name  marks
0    1    a     11
1    2    b     12
2    3    c     13
3    4    d     14
4    5    e     15
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rol     5 non-null      int64
 1   name    5 non-null      object
 2   marks   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes
None
   rol name  marks
0    1    a     11
1    2    b     12
2    3    c     13
3    4    d     14
4    5    e     15
   rol name  marks
0    1    a     11
1    2    b     12
   rol name  marks
0    1    a     11
1    2    b     12
2    3    c     13
3    4    d     14
4    5    e     15
   rol name  marks
3    4    d     14
4    5    e     15
rol       3.0
marks    13.0
dtype: float64
rol         15
name     abcde
marks       65
dtype: object
rol       1
name      a
marks    11
dtype: object
rol       5
name      e
marks    15
dtype: object
rol      5
name     5
marks    5
dtype: int64
            rol      marks
count  5.000000   5.000000
mean   3.000000  13.000000
std    1.581139   1.581139
min    1.000000  11.000000
25%    2.000000  12.000000
50%    3.000000  13.000000
75%    4.000000  14.000000
max    5.000000  15.000000

# how to access DataFrame values

In [3]:
# iloc
#dataframe.iloc[row,col]
print(df.iloc[1,1])

b

In [4]:
print(df.iloc[[1,3],[0,1,2]])

   rol name  marks
1    2    b     12
3    4    d     14

In [5]:
print(df.iloc[[1,3],:])

   rol name  marks
1    2    b     12
3    4    d     14

In [6]:
print(df.iloc[1::2,:3])

   rol name  marks
1    2    b     12
3    4    d     14

In [7]:
#loc
#dataframe.loc[row,col]
#row-->index
#col-->column name
print(df.loc[1,"name"])
print(df.loc[1::2])
print(df.loc[[1,2,3],["name","marks"]])

b
   rol name  marks
1    2    b     12
3    4    d     14
  name  marks
1    b     12
2    c     13
3    d     14

In [8]:
df.to_csv("data.csv",index=False)

# how to access dataset in jupyter

In [9]:
import pandas as pd
df=pd.read_csv("C:\\Users\\Krishna\\Desktop\\dataset\\titanic_train.csv")
df

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
845,158,1,"Hipkins, Mr. William Edward",male,55.0,0,0,680,50.0000,C39,S,NaN,NaN,London / Birmingham,0
846,174,1,"Kent, Mr. Edward Austin",male,58.0,0,0,11771,29.7000,B37,C,NaN,258.0,"Buffalo, NY",0
847,467,2,"Kantor, Mrs. Sinai (Miriam Sternin)",female,24.0,1,0,244367,26.0000,NaN,S,12,NaN,"Moscow / Bronx, NY",1
848,1112,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S,NaN,NaN,NaN,0
849,425,2,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,13.0000,NaN,S,NaN,19.0,"Bronx, NY",0

In [ ]:
# misisng value      NAN is True value consider
#isna

In [11]:
print(df.isna().sum())

passenger_id      0
pclass            0
name              0
sex               0
age             174
sibsp             0
parch             0
ticket            0
fare              1
cabin           659
embarked          1
boat            542
body            777
home.dest       386
survived          0
dtype: int64

# Remove th missing data row

In [12]:
df=df.dropna()
print(df.isna().sum())

passenger_id    0
pclass          0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin           0
embarked        0
boat            0
body            0
home.dest       0
survived        0
dtype: int64

In [19]:
import pandas as pd
#fillna


df=pd.read_csv("C:\\Users\\Krishna\\Desktop\\dataset\\titanic_train.csv")
df
df.fillna(0)
print(df.isna().sum())
mean=df["age"].mean()
print(mean)
df["age"]=df["age"].fillna(mean)
print(df.isna().sum())

passenger_id      0
pclass            0
name              0
sex               0
age             174
sibsp             0
parch             0
ticket            0
fare              1
cabin           659
embarked          1
boat            542
body            777
home.dest       386
survived          0
dtype: int64
29.519847189349115
passenger_id      0
pclass            0
name              0
sex               0
age               0
sibsp             0
parch             0
ticket            0
fare              1
cabin           659
embarked          1
boat            542
body            777
home.dest       386
survived          0
dtype: int64

In [20]:
df=pd.read_csv("C:\\Users\\Krishna\\Desktop\\dataset\\titanic_train.csv")
df
median=df["age"].median()
print(mean)
df["age"]=df["age"].fillna(median)
print(df.isna().sum())

29.519847189349115
passenger_id      0
pclass            0
name              0
sex               0
age               0
sibsp             0
parch             0
ticket            0
fare              1
cabin           659
embarked          1
boat            542
body            777
home.dest       386
survived          0
dtype: int64

In [21]:
df["boat"].mode()

0    4
dtype: object

In [23]:
mode=df["boat"].mode()
print(mean)
df["boat"]=df["boat"].fillna(4)
print(df.isna().sum())

29.519847189349115
passenger_id      0
pclass            0
name              0
sex               0
age               0
sibsp             0
parch             0
ticket            0
fare              1
cabin           659
embarked          1
boat              0
body            777
home.dest       386
survived          0
dtype: int64

In [26]:
df["embarked"]=df["embarked"].fillna(df(["embarked"].mode()[0])
print(df.isna().sum())

SyntaxError: invalid syntax (<ipython-input-26-7eb4d442bd66>, line 2)

In [28]:
import pandas as pd
df=pd.read_csv("data.csv")
print(df)                                   #pad-->previous data
#forward fill
df=df.fillna(method="pad")
print(df)

   rol name  marks
0    1    a   11.0
1    2    b   12.0
2    3    c    NaN
3    4    d   14.0
4    5    e   15.0
   rol name  marks
0    1    a   11.0
1    2    b   12.0
2    3    c   12.0
3    4    d   14.0
4    5    e   15.0

In [31]:
import pandas as pd
df=pd.read_csv("data.csv")
print(df)                                   #bfill-->previous data
#forward fill
df["marks"]=df['marks'].fillna(method="bfill")
print(df)

   rol name  marks
0    1    a    NaN
1    2    b   12.0
2    3    c    NaN
3    4    d   14.0
4    5    e   15.0
   rol name  marks
0    1    a   12.0
1    2    b   12.0
2    3    c   14.0
3    4    d   14.0
4    5    e   15.0

In [37]:
#replace
import pandas as pd
df=pd.read_csv("data.csv")
print(df)  
df=df.replace({"a":"abc"})      #common for a
print(df)

df["name"]=df["name"].replace({"a":"abc"})    #its only for name column
print(df)

   rol name  marks
0    1    a    NaN
1    2    b   12.0
2    3    c    NaN
3    4    d   14.0
4    5    e   15.0
   rol name  marks
0    1  abc    NaN
1    2    b   12.0
2    3    c    NaN
3    4    d   14.0
4    5    e   15.0
   rol name  marks
0    1  abc    NaN
1    2    b   12.0
2    3    c    NaN
3    4    d   14.0
4    5    e   15.0

In [39]:

print(df.iloc[0,:].fillna(0))       #accessing first row

rol        1
name     abc
marks      0
Name: 0, dtype: object

In [40]:
df.

<bound method DataFrame.isna of    rol name  marks
0    1  abc    NaN
1    2    b   12.0
2    3    c    NaN
3    4    d   14.0
4    5    e   15.0>

In [ ]:
#groupby                                              Homework
teams=df.groupby("team")     # pass by column
print(teams.groups)                         

print(teams.get_group(" Kings"))       #charactor pass by " " or int (int value)
print(teams.mean())
print(teams.count())
print(teams.min())
print(teams.max())
print(teams.sum())